package wang.miansen.roothub.common.util;

import java.util.Random;

/**
 * 用户名生成工具类
 *
 * @author 龙德
 * @date 2021-05-21 20:55
 */
public class NicknameUtils {

    /**
     * 随机的用户名
     */
    private static final String[] NICKNAME = {
        "空城", "阔妖", "蓝瑟", "浪庄", "嫘山", "冷面", "离兮", "离织", "莲畔", "良木", "凉簟", "烈火", "灵凰", "聆聆", "零凌", "清流", "流风", "琉璃", "柳下", "龙度",
        "龙若", "龙纹", "泷影", "绿柳", "绿笙", "洛桦", "洛神", "麦灵", "桂平", "竹君", "梦寻", "独淡舞", "荣轩", "名雅", "浩宇", "鸣若", "越泽", "瑾瑜", "墨染", "怡伶",
        "木木", "木子", "皓轩", "南蝶", "南风", "南殇", "倪尔", "玮伦", "坏脾滊", "柠檬", "小茵", "蓬莱", "飘雪", "蒲吾", "普罗旺斯", "七淳", "柒柒", "欣然", "千叶",
        "千饮", "擎苍", "青岚", "青凌", "青山", "轻昀", "清扬", "清帘", "清弥", "清音", "庆云", "琼鸥", "怡婷", "佩芬", "曲飞", "日月", "容水", "晴桦", "亚非", "韵如",
        "塞北", "三木", "三湘", "三元", "秀峰", "礼娇", "纱痕", "雅君", "山石", "孟钰", "韶华", "雅婷", "俊达", "神话", "师", "师栾", "诗韵", "十陵", "智超", "式政",
        "礼钰", "手冢", "蜀中", "佳蓉", "依茂", "健昀", "苏寒", "志宏", "素色", "随长", "太合", "泰山", "糖衣", "宜豪", "桃之", "天天", "天安", "天澜", "天南", "天青",
        "延霆", "佳蓉", "淑佩", "怡君", "美玲", "歪脖", "飞鸿", "航道", "王者", "微微", "微懿", "微雨", "哲维", "俊安", "乌雅", "翔坤", "无迹", "无书", "舞魂", "舞灵",
        "依婷", "夕夕", "文育", "西楚", "西宫", "西陵", "西月", "菁芷", "玉婷", "溪桥", "习沐", "仙侠", "闲眠", "姿婷", "韦荣", "逍遥", "政倩", "小小", "俊达", "耀鹏",
        "心阙", "辛雀", "星澈", "星然", "冠杰", "宜瑶", "美君", "健铭", "絮敛", "玄明", "玄雨", "雪松", "雪影", "绍瑜", "雅雯", "俊民", "尐宅籹", "智钧", "烟杳", "盐水",
        "燕语", "右博", "星如", "夜海", "夜魂", "一然", "伊落", "倚天", "翊依", "逸云", "恩龙", "宁政", "志宏", "尹十", "升毓", "引舞", "隐姜", "瑞霖", "影承", "影缪",
        "胤祥", "幽世", "廷湖", "怡强", "彦韦", "玉钩", "昀琬", "元时", "元夕", "咏钰", "远幻", "政琳", "月邪", "月咏", "云闲", "云想", "云中", "允夏", "冰宇", "元映",
        "照影", "擎宇", "春紫", "雅婷", "舒南", "政文", "雅慧", "彦霖", "志铭", "健毓", "紫雾", "纵横", "凯修", "裕忠", "醉声", "儒歌", "墨衣", "莫邪", "丘黎", "枫朗",
        "溪枫", "爱醒馨", "裕忠", "轩宇", "清远", "默言", "公笑", "侯风", "文耀", "宏扬", "明哲", "彭魄", "溥心", "承基", "昊空", "英睿", "星雨", "泰然", "祺祥", "弘方",
        "巍奕", "博简", "嘉言", "远航", "元青", "鹏飞", "俊爽", "元忠", "成礼", "俊爽", "涵煦", "博易", "鸿振", "玉龙", "哲圣", "奇致", "弘壮", "明俊", "黎昕", "高洁",
        "锐达", "立轩", "濮存", "浩歌", "星驰", "吟风", "凝骁", "吟风", "子桓", "子聿", "阿昌", "安之", "傲风", "傲之", "佩珊", "柏舟", "半夏", "邦少", "彼岸", "伯光",
        "伯雷", "伯庸", "博风", "博思", "博心", "博雅", "博雨", "不败", "不悔", "展天", "残夜", "残竹", "沧海", "韦成", "藏锋", "长歌", "长海", "长青", "朝雨", "沉香",
        "志泽", "辰逸", "半江愁", "成风", "承宇", "乘风", "吹雪", "纯刚", "纯阳", "独龙", "断月", "帆影", "宏儒", "凡之", "飞鹭", "飞莫", "飞烟", "飞扬", "飞羽", "简兮",
        "绯剑", "鸿信", "楷瑞", "赋之", "公子", "宫主", "孤城", "孤风", "孤鸿", "孤岚", "广志", "博海", "寒风", "寒兮", "寒月", "浩天", "浩云", "皓轩", "皓月", "和风",
        "欣瑜", "宏轩", "对与错", "怀瑾", "怀礼", "怀信", "怀义", "怀智", "幻月", "旺劭", "剑魂", "剑泣", "剑秋", "剑心", "剑星", "明哲", "京墨", "惊风", "惊涛", "惊云",
        "乐之", "冷桑", "冷松", "怡爱", "凉风", "临风", "临江", "灵均", "灵智", "翎翎", "聆风", "聆寒", "聆天", "流火", "流年", "流星", "六月", "六州", "龙吟", "弘文",
        "明月", "墨情", "纳西", "南风", "南星", "逆天", "蹑云", "宁霄", "天翊", "千谷", "千青", "千树", "千叶", "青岩", "青云", "卿园", "清非", "清风", "清歌", "清然",
        "清天", "清啸", "求败", "仁通", "如风", "鲍婉墨", "若尘", "若楚", "若风", "若枫", "若寒", "若江", "若望", "若轩", "若影", "裳秋", "少爷", "深蓝", "神殇", "神弑",
        "圣天", "凯瑞", "朔风", "思豪", "思淼", "思睿", "思影", "思远", "菘蓝", "随风", "随云", "天赐", "天峰", "天心", "天韵", "听风", "听雨", "听云", "亭志", "忘生",
        "忘忧", "维林", "维叶", "炜彤", "文博", "文迪", "文涵", "文浩", "文俊", "文熙", "文轩", "文扬", "文哲", "无敌", "无风", "无乐", "无命", "无情", "无天", "无雪",
        "无寻", "无言", "无影", "白长发", "武峰", "武魂", "武灭", "武尊", "弦河", "弦墨", "弦星", "弦音", "弦语", "弦之", "小凡", "小风", "小霖", "晓飞", "晓枫", "晓峰",
        "晓天", "啸", "啸风", "信之", "星辰", "星魂", "星语", "星云", "轩瑞", "炫鸣", "傲海", "雪阳", "晨浩", "子晨", "子画", "子言", "言怀", "炎月", "遥峰", "夜风",
        "一刀", "一凡", "一风", "一鸣", "一舟", "义枫", "忆年", "亦风", "亦言", "易之", "奕世", "弈秀", "逸飞", "潇然", "子涵", "宇轩", "雨轩", "雨泽", "玉鸿", "庭玮",
        "御风", "耀杰", "远志", "云流", "云深", "云天", "正则", "智渊", "仲强", "逐云", "庄主", "追风", "追朔", "追云", "子凡", "子涵", "子君", "虚竹", "宗衡", "宗正",
        "醉风", "健雄", "成弘", "承天", "承悦", "初南", "尔清", "弘文", "幻锋", "幻寒", "嘉熙", "静宸", "静枫", "俊驰", "俊楠", "茜彦", "离殇", "凌远", "子轩", "天楚",
        "天豪", "天昊", "天浩", "天逸", "天佑", "问天", "夕泽", "烨磊", "以沐", "逸云", "越泽", "泽天", "泽语", "昭祥", "伟伦", "至睿", "志泽", "致远", "子骞", "以宸",
        "澈轩", "舂钡铑", "默隐", "宇烽", "远航", "楷瑞", "哲瀚", "烨霖", "黎昕", "皓轩", "擎苍", "擎宇", "天磊", "绍辉", "浩南", "泽洋", "鑫磊", "鹏煊", "博文", "昊强",
        "越泽", "旭尧", "伟宸", "博超", "君浩", "子骞", "伟泽", "越彬", "靖琪", "明辉", "伟诚", "明轩", "健柏", "修杰", "志泽", "晋鹏", "煜祺", "智宸", "正豪", "昊然",
        "明杰", "立轩", "峻熙", "嘉懿", "煜城", "懿轩", "弘文", "烨伟", "苑博", "鹏涛", "炎彬", "鹤轩", "君昊", "熠彤", "鸿煊", "博涛", "苑杰", "夕曜", "睿渊", "宇翔",
        "方翔", "宏维", "维嘉", "玄维", "豪棋", "君炜", "凡魔域", "贤信", "瀚韬", "剑锋", "楚洋", "瑞华", "逍逸", "仕杰", "久生厌", "星然", "振宇", "旭东", "沁洋",
        "雅博", "志伟", "希翼", "海焘", "柏云", "俊德", "思扬", "灿烽", "昕尧", "潇逸", "诺诺", "文昊", "伟祺", "昊强", "君浩", "尉汐", "韶德", "炎博", "常绍", "豪澄",
        "丁蒙", "彬蔚", "彬彬", "博裕", "博容", "博艺", "承德", "朝宗", "澄泓", "存志", "澹雅", "得韬", "德辉", "方旭", "飞轩", "和畅", "涵畅", "浩初", "浩然", "浩学",
        "泓涵", "嘉言", "嘉懿", "江沅", "景铄", "隽秀", "俊材", "俊杰", "俊爽", "俊伟", "俊誉", "峻雅", "凯歌", "凯凯", "凯泽", "孔阳", "澜清", "乐心", "乐欣", "乐康",
        "乐成", "霖霖", "曷凉嗏", "琦玮", "若光", "若华", "胜蓝", "斯年", "腾文", "腾扬", "腾逸", "恬简", "望舒", "文彬", "文翰", "文澜", "文心", "文雅", "文懿",
        "空心率", "星驰", "星轩", "修远", "煦涵", "雅醇", "雅歌", "雅厚", "雅亮", "雅胜", "怡然", "弈鸣", "熠然", "羽丰", "语心", "悠然", "悠永", "煜月", "韫玉", "悦畅",
        "震烨", "志鹏", "钟毓", "周翰", "周晟", "朱轩", "子衿", "自清", "自修", "朝辉", "志尚", "志行", "志致", "安邦", "安歌", "安翔", "滨海", "彬郁", "波峻", "波鸿",
        "才捷", "才哲", "成济", "承安", "成恩", "承运", "承志", "承泽", "德宇", "德佑", "德元", "德明", "冠宇", "光远", "光耀", "光启", "高远", "高逸", "高朗", "弘信",
        "宏远", "鸿祯", "鸿振", "华辉", "华荣", "嘉赐", "嘉茂", "嘉平", "嘉年", "嘉慕", "嘉荣", "建章", "建中", "季同", "康时", "立诚", "立群", "朋义", "彭祖", "鹏池",
        "鹏飞", "浦泽", "浦和", "奇略", "奇迈", "奇胜", "奇思", "奇玮", "奇文", "奇希", "奇逸", "奇志", "祺福", "祺然", "祺祥", "祺瑞", "琪睿", "锐锋", "锐思", "锐意",
        "圣杰", "思聪", "思源", "思博", "泰初", "秦和", "天瑞", "伟毅", "兴运", "星剑", "星晖", "星汉", "星海", "星宇", "星雨", "星渊", "星洲", "炫明", "阳州", "阳荣",
        "阳羽", "咏志", "勇毅", "宇航", "泽宇", "元勋", "元正", "元凯", "元嘉", "玉堂", "子瑜", "傲尘", "傲血", "白歌", "白轩", "白岩", "白玉", "百战", "半月", "宝梓",
        "北北", "北烟", "波时", "不破", "才子", "残魂", "残阳", "沧月", "苍涛", "长松", "长溪", "长永", "怅真", "朝常", "潮音", "澈烨", "宸游", "晨州", "乘龙", "程萃",
        "蚩灵", "驰健", "驰醉", "持国", "穿云", "吹荷", "春生", "辞穹", "丹峰", "丹空", "丹青", "丹霄", "单羽", "澹珂", "盗帅", "帝华", "帝灵", "殿千", "雕墨", "定军",
        "东屋", "独尊", "渡寒", "断潮", "断魂", "断岳", "断竹", "遁影", "夺魄", "恩宝", "帆湍", "凡山", "芳主", "飞尘", "飞泉", "飞星", "非夜", "费费", "纷翌", "风触",
        "风华", "风来", "风名", "风淅", "枫苑", "封情", "烽远", "浮光", "高诗", "歌阙", "亘羿", "孤随", "孤云", "古虫", "古航", "谷寒", "归羽", "海沈", "寒高", "寒箭",
        "寒亭", "寒玉", "汉文", "翰墨", "豪雨", "浩奇", "鹤归", "鹤铁", "鹤轩", "衡风", "鸿越", "忽昭", "胡志", "湖凡", "华宫", "画词", "画楫", "怀旅", "寰宇", "荒芜",
        "晃浪", "几米", "季卿", "季烁", "季真", "寂灭", "佳裾", "剑飞", "剑风", "剑封", "剑茗", "剑浦", "剑青", "剑一", "渐挽", "江风", "江涵", "江南", "江月", "竭磊",
        "尽离", "惊鸿", "惊龙", "惊梦", "惊羽", "靖奇", "静波", "九天", "旧寰", "居山", "居义", "卷仑", "军临", "君豪", "均均", "俊熙", "俊轩", "卡诺", "堪驽", "空城",
        "空谷", "狂意", "梨夕", "离火", "离经", "立果", "连城", "练雄", "梁艳", "裂石", "临楚", "凌风", "凌空", "零非", "零寂", "流川", "流翼", "六合", "龙驰", "龙翔",
        "龙牙", "珑阮", "珑重", "露西", "鸾轻", "乱雨", "掠影", "罗生", "洛城", "骆生", "落星", "满川", "满渡", "满归", "门笑", "孟康", "觅星", "渺风", "明光", "明狂",
        "明唐", "明轩", "铭宵", "墨烟", "墨炎", "墨云", "木白", "牧丰", "幕云", "慕天", "暮寒", "暮鸥", "暮续", "暮岩", "暮云", "南皇", "年生", "凝空", "庞栖", "佩星",
        "蓬浅", "平楚", "平志", "凭虚", "萍风", "七梧", "栖松", "奇凡", "骐骥", "乾坤", "乾元", "潜渊", "浅笑", "浅鱼", "桥月", "且惬", "青诚", "青弘", "青乐", "青染",
        "青山", "青石", "青涛", "卿璧", "卿谷", "清江", "清平", "清水", "清月", "清泽", "琼琴", "秋影", "曲沓", "曲葛", "泉幽", "泉月", "群御", "髯客", "冉飞", "柔德",
        "闰五", "赛雪", "桑客", "煞灵", "山墨", "山朴", "伤城", "智辉", "商殿", "商羽", "尚东", "尚清", "尚玄", "邵腾", "生森", "诗百", "诗禅", "守一", "书画", "书怀",
        "书魂", "书墨", "书棋", "书雨", "殊初", "疏狂", "疏影", "霜白", "顺庆", "舜绾", "思魂", "思曲", "思则", "思主", "斯瑞", "松涛", "肃明", "粟栖", "随行", "碎魄",
        "碎星", "碎月", "邰砚", "太虚", "腾雷", "腾跃", "天黯", "天工", "天霁", "天乐", "天罗", "天芒", "天明", "天穆", "天奇", "天山", "天晚", "天行", "天游", "添乌",
        "听潮", "听雷", "庭裴", "庭韵", "吞海", "吞吴", "拓离", "拓尹", "宛岩", "万珂", "万柳", "望云", "伟宸", "苇箫", "问水", "无痕", "无恨", "无量", "无声", "无畏",
        "无我", "无心", "吴山", "五陵", "雾贤", "夕照", "西睿", "息戚", "仙录", "仙疏", "仙踪", "翔空", "枭月", "绡单", "逍遥", "小墨", "小隙", "晓寒", "晓哉", "笑何",
        "笑夜", "啸晋", "啸日", "卸元", "心灭", "心问", "歆渐", "鑫磊", "星奕", "星月", "行歌", "修空", "修缘", "欢尽夜", "煦耐", "轩宇", "宣初", "喧霁", "玄机", "玄色",
        "炫寒", "雪茫", "雪松", "烟顾", "言循", "炎青", "颜虞", "雁初", "阳宝", "爻世", "遥行", "杳虚", "叶青", "夜可", "夜渊", "一树", "伊诺", "伊人", "遗昔", "忆楼",
        "亦空", "亦然", "益风", "殷樨", "银东", "应物", "影秋", "映楼", "永砚", "幽来", "幽冥", "游龙", "于穆", "羽龙", "雨岚", "雨鸾", "语琪", "语堂", "玉城", "玉箫",
        "郁痕", "郁清", "元和", "元枚", "月独", "月寒", "月声", "月萧", "悦言", "越斌", "越华", "云别", "云飞", "云歌", "云寄", "云景", "云裾", "云眠", "云巫", "云烟",
        "蕴空", "斋子", "展赫", "哲弘", "真淳", "争知", "知画", "知墨", "知七", "知书", "知章", "止扇", "止水", "质筵", "智辽", "重九", "舟尔", "竹天", "烛龙", "烛天",
        "追命", "追月", "灼生", "子木", "子谦", "子墟", "子缘", "自在", "宗时", "走沙", "醉阳", "醉月", "左风", "左轮", "暧暧", "白微", "白轩", "柏舟", "半夏", "蓓颖",
        "彼岸", "潇潇", "琳婉", "妖儿", "倾欢", "君怜", "柳丝", "绮思", "罂粟", "缇娜", "伟祺", "蓉雪", "浅沫", "念薇", "之瑶", "静曼", "易梦", "惜雪", "惜霜", "书芹",
        "以蓝", "忆寒", "诗云", "芷巧", "映之", "雅彤", "从安", "雨珍", "香柏", "又晴", "凝芙", "千凝", "盼香", "映梦", "凌珍", "芃芃", "绮波", "兰若", "千儿", "傲蕾",
        "静夜", "梦璃", "落影", "卿妤", "记住我", "采芷", "倚云", "云若", "清涟", "挽菡", "碧蝶", "博心", "博雅", "博雨", "博玉", "不悔", "采薇", "残雪", "残夜", "婵娇",
        "从安", "苁蓉", "黛姝", "黛玉", "蝶衣", "冬葵", "凡之", "芳沁", "飞雪", "飞烟", "飞羽", "墨雨", "飞鸢", "飞云", "绯歌", "绯曲", "霏霏", "凤鸣", "宫主", "隽菁京",
        "寒风", "寒兮", "寒月", "诃子", "和风", "红枫", "红拂", "红雪", "钰轩", "唤晴", "越彬", "哲瀚", "璟雯", "静姝", "静妍", "静云", "可人", "可馨", "乐之", "冷桑",
        "黎心", "怜花", "恋蝶", "恋枫", "恋寒", "恋夜", "恋月", "恋云", "灵均", "灵雨", "灵芸", "久不绊", "聆风", "聆寒", "聆柔", "聆雪", "聆雨", "绿烟", "绿竹", "曼莉",
        "曼丽", "曼琳", "曼娜", "曼婷", "曼瑶", "曼媛", "魅之", "萌萌", "怜心", "梦洁", "梦泉", "梦萦", "明雅", "慕灵", "念慈", "念心", "念雪", "宁霄", "凝夜", "盼兮",
        "佩兰", "佩玉", "芃芃", "琦菲", "千蝶", "千泷", "浅沫", "浅瑜", "浅语", "倩兮", "俏音", "青黛", "卿心", "清荷", "清珂", "清音", "清楂", "清紫", "琼琚", "秋蝉",
        "秋晓", "荏苒", "如歌", "如水", "如雪", "如烟", "如妍", "如言", "如雨", "如语", "如云", "茹雪", "若静", "若水", "若夕", "若曦", "若炫", "若雪", "若妍", "若言",
        "若洋", "若谣", "若云", "善妍", "断牵引", "诗萌", "诗琪", "诗音", "书雁", "雨泽", "丝曼", "思柔", "思甜", "素素", "恬然", "听风", "听雨", "听云", "宛白", "晚风",
        "晚晴", "晚星", "婉慧", "婉静", "婉娜", "婉清", "婉然", "婉仪", "琬凝", "薇儿", "薇琳", "薇琪", "维林", "维叶", "炜彤", "文丹", "温玉", "文涵", "文暄", "无晴",
        "无双", "无雪", "无言", "舞蝶", "舞之", "旭尧", "夕若", "夕阳", "惜莲", "仙儿", "弦歌", "弦河", "弦墨", "弦星", "弦音", "弦语", "弦之", "香蕈", "抚桃树", "小凤",
        "小曼", "小仙", "晓倩", "晓霜", "晓雯", "晓雨", "晓月", "筱雨", "心文", "心昕", "心馨", "心妍", "心言", "心仪", "欣妍", "歆瑶", "馨蕊", "信芳", "晏晏", "燕飞",
        "燕婉", "采绿薇", "琇莹", "萱草", "雪海", "雪婷", "雪阳", "号冻结", "烟柳", "烟云", "雨泽", "夭夭", "妖月", "俊驰", "依依", "颐岩", "忆梦", "忆舞", "亦茹",
        "亦雨", "亦语", "茵茵", "盈盈", "悠云", "游曦", "羽落", "雨鸾", "雨墨", "雨瞳", "雨嫣", "语嫣", "鸿涛", "玥怡", "云曦", "云烟", "芣蓅垳", "摘星", "蓁蓁", "致远",
        "芷青", "子墨", "子默", "紫轩", "醉舞", "醉雪", "醉月", "醉云", "安筠", "安露", "安然", "冰蝶", "蝶舞", "尔雯", "尔雅", "尔颖", "寄瑶", "佳琦", "瑾萱", "瑾瑜",
        "婧琪", "靖瑶", "静琪", "静璇", "珺瑶", "墨蝶", "琪涵", "熙雯", "风华", "烨华", "竹喧", "梨落", "晨怡", "婉莎", "倩媛", "灵秀", "丽婵", "娜雅", "燕妮", "舒云",
        "宜文", "修洁", "黎昕", "若莎", "燕津", "柳莺", "丽月", "芳菲", "雨霏", "若霏", "艺娇", "子芳", "品丽", "巧真", "逍逸", "晓瑜", "文芳", "晟睿", "文昊", "含微",
        "静媛", "思珑", "瑾澜", "雅菲", "心悦", "晓越", "蝶澈", "思瑜", "颖琳", "晨尔", "莺歌", "美宁", "秀颀", "奕琳", "可虹", "燕煌", "雪羽", "景芸", "静瑜", "慧君",
        "丹琳", "自芳", "琳叶", "芳欣", "叱江河", "冰心", "思静", "艳秋", "清秋", "舒雨", "海棠", "芙蓉", "青梅", "晶晶", "青蓉", "红袖", "沐卿", "邀月", "月舞", "莺莺",
        "牡丹", "昭容", "剪秋", "百喜", "青萝", "青蕾", "青菲", "依萱", "安楠", "香蝶", "盼雁", "谷菱", "梦易", "含芙", "幼珊", "夏柳", "安安", "碧曼", "白秋", "絮瑶",
        "绮梅", "绿海", "婉君", "书萱", "怀颖", "怀雁", "如依", "梦槐", "雨安", "浣碧", "怀慈", "平春", "香巧", "向雪", "陵容", "眉庄", "曼玉", "映雪", "晓芙", "傲雪",
        "晗晗", "熙熙", "诺诺", "韵瑄", "芮雪", "畅妮", "芳华", "管彤", "浩丽", "泓浵", "慧艳", "慧语", "非烟", "嘉言", "嘉懿", "江沅", "静淞", "隽秀", "俊慧", "俊丽",
        "可佳", "乐心", "乐仪", "乐容", "乐欣", "乐康", "乐成", "烨磊", "霖霖", "灵犀", "落霞", "曼衍", "曼语", "曼吟", "琦玮", "清芬", "清研", "清扬", "清越", "晴岚",
        "琪华", "清芷", "若飞", "若华", "恬如", "恬适", "恬雅", "婉妙", "婉柔", "婉悦", "望舒", "文丽", "文心", "文澜", "文雅", "文懿", "远航", "娴雅", "欣怡", "馨逸",
        "雅歌", "怡然", "懿美", "潆泓", "颖逸", "余馨", "羽丰", "语心", "悠然", "悠柔", "煜月", "韫玉", "悦心", "悦欣", "悦畅", "悦爱", "钟灵", "自珍", "智敏", "安妮",
        "安娜", "白雪", "碧菡", "冰蓝", "采文", "采萱", "丹彤", "芳蕙", "芳洲", "芳林", "飞燕", "谷雪", "古兰", "古韵", "歌飞", "格菲", "葛菲", "戈雅", "格格", "含烟",
        "含玉", "涵菡", "晗蕾", "晗玥", "寒凝", "寒香", "寒雁", "和怡", "和雅", "和玉", "虹雨", "虹英", "虹颖", "怀玉", "虹影", "慧心", "慧颖", "慧雅", "慧美", "慧捷",
        "慧月", "慧云", "慧秀", "家美", "家欣", "家馨", "佳悦", "嘉怡", "嘉宝", "嘉悦", "嘉云", "静娴", "静婉", "静雅", "静慧", "静安", "静秀", "娟秀", "娟巧", "兰若",
        "兰蕙", "兰梦", "兰娜", "岚霏", "乐悦", "灵卉", "灵萱", "玲玲", "玲珑", "凌波", "凌霜", "凌雪", "米琪", "梦菲", "梦凡", "梦菡", "梦露", "梦琪", "梦秋", "梦竹",
        "茉莉", "蓉蓉", "如风", "诗兰", "舒兰", "思美", "施诗", "思云", "天心", "恬静", "惜文", "晓燕", "晓莉", "晓凡", "笑寒", "心语", "心宜", "心诺", "欣可", "璇玑",
        "雅宁", "湛芳", "朵儿", "蝶梦", "彩静", "海儿", "吉月", "季雅", "霁芸", "佳思", "姣丽", "珺娅", "珺琪", "筠心", "筠溪", "君洁", "今歌", "今瑶", "晶滢", "锦诗",
        "瑾瑶", "艾月", "爱凤", "爱若", "暗香", "傲珊", "白壁", "白衣", "半夕", "伴绿", "碧断", "碧寒", "碧湖", "碧空", "碧落", "碧伞", "碧水", "碧瑶", "碧媛", "碧月",
        "璧静", "冰葵", "冰杏", "波暖", "不舞", "彩岸", "彩衣", "藏莺", "嫦娥", "朝情", "承殊", "尺云", "初轻", "吹荷", "垂柳", "春香", "春音", "春媛", "瓷微", "慈琼",
        "簇烟", "翠儿", "翠微", "翠西", "翠羽", "寸心", "黛茜", "丹琴", "丹月", "淡腾", "淡月", "德配", "荻花", "笛春", "笛子", "东芝", "冬儿", "冬榕", "杜瑶", "朵姣",
        "芳亭", "芳纤", "飞霜", "绯红", "菲菲", "菲靓", "粉澜", "凤琪", "芙冷", "浮萍", "伽蓝", "咕嘟", "海雁", "晗婷", "寒骨", "寒静", "寒梅", "寒雪", "盒子", "黑蝶",
        "红菡", "红笺", "红钕", "鸿思", "花鼓", "花间", "花葵", "花瞳", "花颖", "花影", "花语", "埖裳", "华容", "华笙", "欢绪", "欢影", "幻荷", "幻灵", "幻烟", "幻紫",
        "回雪", "汇贞", "悸陌", "娇绮", "金霞", "金摇", "锦夜", "锦藻", "婧衣", "静波", "静柔", "静斜", "静逸", "九久", "九猫", "菊馨", "娟燕", "君慧", "君君", "空梦",
        "兰居", "兰玉", "兰芷", "岚尘", "阑珊", "蓝欣", "澜音", "乐笙", "蕾森", "泪凝", "泪衣", "冷香", "冷絮", "梨苞", "梨巧", "梨株", "离殇", "丽娅", "荔纱", "蓼篱",
        "灵姬", "灵欣", "白兰地", "凌芬", "凌梦", "菱歌", "流碧", "流水", "留香", "珑月", "露凝", "露烟", "露芷", "绿春", "绿濛", "绿茵", "罗儿", "罗霜", "洛灵", "洛盘",
        "落花", "落漫", "玛莎", "麦麦", "蛮弦", "曼曼", "眉度", "眉真", "梅菊", "梅陌", "梅心", "梅雁", "美兮", "梦归", "梦觉", "梦鸯", "弥雪", "迷凉", "绵枫", "明兰",
        "明明", "缪花", "末雨", "莫莫", "墨白", "墨音", "木惜", "沐丹", "沐雨", "墓心", "穆儿", "霓裳", "霓衣", "霓云", "念念", "念笙", "念薇", "凝光", "凝梦", "凝梧",
        "凝月", "浓妆", "弄蝶", "泡沫", "彭颖", "飘兮", "颦笑", "萍聚", "婆雅", "栖梧", "琪霏", "琪舞", "绮雾", "千堤", "千秋", "千曲", "千色", "千丝", "千缘", "千媛",
        "芊昔", "签云", "浅笑", "巧汝", "翘翘", "琴歌", "琴宁", "琴卿", "琴清", "琴婴", "青烟", "轻舞", "卿尘", "清寒", "清篱", "清露", "清然", "清蓉", "晴语", "裘画",
        "曲艺", "曲云", "雀翎", "鹊踏", "然笑", "纫蒂", "如兰", "如期", "茹慈", "嫰瑜", "若耶", "飒荷", "三蝶", "三芳", "桑鹂", "桑紫", "纱馨", "莎莉", "姗姗", "珊慕",
        "书采", "书琴", "书雪", "淑兮", "疏雪", "双蛮", "双双", "霜回", "霜枝", "水儿", "水沫", "水榭", "水妍", "水月", "水云", "丝锁", "思思", "思忆", "斯琴", "素妍",
        "素影", "宿心", "棠梨", "天颜", "天兆", "天真", "亭香", "童心", "晚照", "婉风", "婉妞", "婉容", "微尘", "微落", "微眠", "爱留恋", "文彩", "无舞", "梧雨", "舞歌",
        "舞柳", "兮兮", "西淑", "西子", "惜雪", "溪霜", "溪西", "席离", "细黛", "夏末", "纤纤", "香暗", "香君", "香柳", "香茵", "翔鸾", "响溶", "哓婉", "哓夕", "消乔",
        "小白", "小诗", "小婉", "小唯", "小西", "小薰", "小言", "小燕", "小妖", "小鱼", "小渔", "晓意", "笑笑", "笑颜", "辛锦", "馨月", "信花", "信子", "星儿", "星蜜",
        "星雪", "杏林", "杏喜", "秀卷", "秀秀", "绣袂", "袖倚", "轩寒", "雪纷", "雪落", "雪竹", "薰洁", "丫丫", "雅尼", "烟孱", "嫣红", "嫣然", "颜雨", "燕姬", "燕燕",
        "燕子", "夭桃", "夜桃", "一素", "一笑", "伊悴", "伊人", "伊蕊", "衣悔", "衣衣", "意纱", "音采", "音儿", "音符", "隐玉", "莺鸣", "樱花", "樱梨", "樱墨", "樱桃",
        "樱杏", "盈溟", "萦斜", "颖颖", "影芜", "影影", "幽兰", "悠惹", "虞子", "雨晨", "雨飞", "雨岚", "雨翎", "雨荨", "雨情", "雨然", "雨叶", "雨约", "玉笛", "玉玲",
        "玉梅", "玉清", "玉璇", "浴妆", "寓兰", "园荳", "愿鸳", "月华", "月陌", "月桥", "月月", "云荷", "云佳", "云翩", "云裳", "云兮", "云月", "韵叠", "韵月", "枕簟",
        "之鹤", "之兰", "知灵", "知曼", "知琴", "知晴", "知雪", "舟芙", "茱萸", "珠燕", "竹云", "竹韵", "渚琪", "桩桩", "追芬", "子采", "子黛", "子晗", "子荷", "子君",
        "子萌", "子梦", "子末", "子倾", "子卿", "子旋", "子樱", "子羽", "子芸", "子韵", "紫菱", "紫洛", "紫霞", "紫夜", "醉梦", "不恋旧", "悔难追", "怀旧癖", "别转身",
        "空色瞳", "居芝燕", "来年春", "锅是铁", "孤也战", "眷恋飞", "断不了", "凰凯儿", "涐狠赞", "尕脑袋", "简约美", "巩锦锋", "関于咃", "何久酒", "井坤乔", "恩格斯", "堕落美",
        "京晓倩", "回首爱", "财才来", "城亦雪", "薄美莺", "军美鹅", "嗯很爱"
    };

    /**
     * 生成随机用户名
     *
     * @return 用户名
     */
    public static String generateNickname() {
        int nLen = NICKNAME.length;
        Random random = new Random();
        return NICKNAME[random.nextInt(nLen)];
    }
}
